Rezillien/STM32MIDI/Src/main.c
}


int8_t CDC_Receive_HS (uint8_t* Buf, uint32_t *Len)
{

     
  /* USER CODE BEGIN 6 */ // CDC_Receive_FS  is a callback function. When data were received, the system calls this function. The received data can be accessed via Buf,and *Len
    //s_RxBuffers.IsCommandDataReceived=1; //indicates data were received
    //s_RxBuffers.CommandsLens[s_RxBuffers.pos_receive]=*Len; //only set the length, data was directly saved to buffer
     
    //s_RxBuffers.pos_receive++;//move to next position to receive data  
    //if(s_RxBuffers.pos_receive>=MaxCommandsInBuffer) //reach the last buffer, need to rewind to 0
    //{
    //    s_RxBuffers.pos_receive=0;
    //}      
     
//prepare to receive the next data
    //USBD_CDC_SetRxBuffer(hUsbDevice_0, s_RxBuffers.UserRxBufferFS[s_RxBuffers.pos_receive]);//Set the buffer to receive incoming data
    //USBD_CDC_ReceivePacket(hUsbDevice_0);// Tell that you are ready to receive the next packet, otherwise you wouldn't be able to receive next data


    //printf("recived");
    MessageLength = sprintf(DataToSend, "recived\n", MessageCounter);
    CDC_Transmit_HS(DataToSend, MessageLength);
    //osDelay(1);
 
     return USBD_OK;
      
  /* USER CODE END 6 */
}

//////////////////////////////////////////////////
//////////////////////////////////////////////////
//////////////////////////////////////////////////
//////////////////////////////////////////////////
//////////////////////////////////////////////////

void setupBassGuitar(uint8_t data_byte_1_instrument){
    uint8_t systemExlusiveSyncMessage=0xF0,syncByte=0xF0; //work around problem with 2 byte messages

    //MessageLength = sprintf(DataToSend, "%c%c%c",systemExlusiveSyncMessage,syncByte,syncByte);
    //CDC_Transmit_HS(DataToSend, MessageLength);


    uint8_t status_byte_instrument=0xC2;//MIDI channel 2
    
    
    osDelay(10);
    MessageLength = sprintf(DataToSend, "%c%c%c",status_byte_instrument,data_byte_1_instrument,0x02);
    CDC_Transmit_HS(DataToSend, MessageLength);

    
}

uint8_t setupStatusByte(uint8_t keyStatus){
    if(keyStatus == 0){//note on
        return 0x92;
    }else{//note off
        return 0x82;
    }
}

uint8_t setupDataByte2(uint8_t row,uint8_t column){
    return 52 + column + 5*row;
}


/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{
  /* init code for USB_DEVICE */
  MX_USB_DEVICE_Init();

  uint8_t data_byte_1_instrument=0x01;//piano and starting point

  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    

    uint8_t keyStatus=0, row=0, column=0,system=0;
    
    uint8_t c=0;
    while(c==0){ 
        c=readkey();  //readkey is non blocking function
        osDelay(5);

    }
    c-=1;//real c = c - 1 because there is problem when c == 0

    /*
    c=ABCCDDDDb
    A   -> if A == 1 it's system message 
           else row and column on guitar
    B   -> key on or off
    CC  -> row index
    DDDD-> column index
    */
    uint8_t syncKeyStatusMask = 0x80;
    uint8_t keyStatusMask = 0x40;
    uint8_t rowMask = 0x30;
    uint8_t columnMask = 0xF;
    
    system = (c & syncKeyStatusMask);
    keyStatus = c & keyStatusMask;
    row = c & rowMask;
    column = c & columnMask;
    row = row >> 4;

    //0x80 -> instrument++
    //0x81 -> instrument--
    


    if(system!=0){
	if(c == (uint8_t)0x80)
            data_byte_1_instrument=(data_byte_1_instrument+1)%0x80;
        else if(c == (uint8_t)0x81)
            data_byte_1_instrument=(data_byte_1_instrument-1)%0x80;
        setupBassGuitar(data_byte_1_instrument);
        continue;
    }

    uint8_t status_byte=0;
    uint8_t data_byte_1=0;
    uint8_t data_byte_2=0x7F;

    status_byte = setupStatusByte(keyStatus);
    data_byte_1 = setupDataByte2(row, column);

    MessageLength = sprintf(DataToSend, "%c%c%c",status_byte,data_byte_1,data_byte_2);
    CDC_Transmit_HS(DataToSend, MessageLength);

  }
  /* USER CODE END 5 */ 
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
/* USER CODE BEGIN Callback 0 */

/* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
/* USER CODE BEGIN Callback 1 */

/* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

static void print_chr(char chr)
{
    HAL_UART_Transmit(&huart1,
    (uint8_t*)&chr, 1, 1000);
}


ssize_t _write_r(struct _reent *r, int fd, const void *ptr, size_t len)
{
    int cntr = len;
    char *pTemp = (char*)ptr;
    while(cntr--)
        print_chr(*pTemp++);
    return len;
}

char readkey(void)
{
    uint8_t rxed;
    HAL_StatusTypeDef res =
        HAL_UART_Receive(&huart1,&rxed,1,1);


    if(res == HAL_OK)
        return rxed;
    else
        return 0;
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
